doom/.doom.d/config.org
# -*- mode: org; coding: utf-8; -*-
#+TITLE: Ashfaq Farooqui's Emacs Configuration
#+AUTHOR: Ashfaq Farooqui
#+EMAIL: ashfaq@ashfaqfarooqui.me
#+OPTIONS: toc:3 num:nil
#+startup: overview


* Lexical binding
This is requried for the org roam stuff
#+begin_src emacs-lisp

;; -*- lexical-binding: t; -*-

#+end_src
* User Details
#+begin_src emacs-lisp

     (setq user-full-name "Ashfaq Farooqui")
     (setq user-mail-address "ashfaq@ashfaqfarooqui.me")

(setq auth-sources '("~/.authinfo.gpg")
      auth-source-cache-expiry nil) ; default is 7200 (2h)

#+end_src
* Visual  configuration

** In editor
taken from https://tecosaur.github.io/emacs-config/config.html#font-display
** Fonts
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font Mono" :size 20)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font Mono" :size 35)
      doom-variable-pitch-font (font-spec :family "JetBrainsMono Nerd Font Mono" :size 20))

                                        ;(setq doom-font (font-spec :family "Overpass" :size 30)
                                        ;  doom-big-font (font-spec :family "fira code retina" :size 50)
                                        ;doom-variable-pitch-font (font-spec :family "Overpass" :size 33))
(setq doom-theme 'catppuccin)



                                        ;(setq doom-font (font-spec :family "mononoki Nerd Font" :size 12 :weight 'semi-light)
                                        ;      doom-variable-pitch-font (font-spec :family "mononoki Nerd Font") ; inherits `doom-font''s :size
                                        ;      doom-big-font (font-spec :family "mononoki Nerd Font" :size 19))




                                        ;(setq doom-font (font-spec :family "mononoki Nerd Font" :size 12 :weight 'semi-light)
                                        ;      doom-variable-pitch-font (font-spec :family "Fira Sans") ; inherits `doom-font''s :size
                                        ;      doom-unicode-font (font-spec :family "mononoki Nerd Font" :size 12)
                                        ;      doom-big-font (font-spec :family "Fira Mono" :size 19))


                                        ;(setq doom-font (font-spec :family "Mononoki Nerd Font" :size 30)
                                        ;      doom-big-font (font-spec :family "Mononoki Nerd Font" :size 36)
                                        ;      doom-variable-pitch-font (font-spec :family "iA Writer Quattro S" :size 24)
                                        ;)



                                        ;(setq doom-font (font-spec :family "iA Writer Quattro S" :size 24)
                                        ;      doom-big-font (font-spec :family "iA Writer Quattro S" :size 36)
                                        ;      doom-variable-pitch-font (font-spec :family "iA Writer Quattro S" :size 24)
                                        ;      doom-serif-font (font-spec :family "iA Writer Quattro S" :weight 'light))
#+END_SRC

** Rainbow mode
#+BEGIN_SRC emacs-lisp
(use-package! rainbow-mode
  :after rainbow-delimiter
:init (rainbow-mode))

#+END_SRC

** nyan mode
#+BEGIN_SRC emacs-lisp
    (after! nyan-mode
         :init
        (nyan-mode))


#+END_SRC
*
* My Defaults
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src
** Evil
#+begin_src emacs-lisp
(setq evil-move-cursor-back nil)


#+end_src

** COMMENT Supersave
#+begin_src emacs-lisp
(after! super-save
(super-save-mode 1)
(setq super-save-exclude '(".gpg"))
(setq super-save-auto-save-when-idle t)
)
#+END_SRC
** COMMENT Wrap paragraphs automatically
I don't like =AutoFillMode= which  automatically wraps paragraphs, kinda
like hitting =M-q=. But i like wrapped paragraphs, hence use visual fill
mode

#+BEGIN_SRC emacs-lisp

        (add-hook! org-mode :append
                   #'visual-line-mode)

        (add-hook! text-mode :append
                   #'visual-line-mode)

        (add-hook! latex-mode :append
                   #'visual-line-mode)

        (use-package! visual-fill-column
          :config
          (add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
          (advice-add 'text-scale-adjust :after
                      #'visual-fill-column-adjust)
          (setq visual-fill-column-width 100)
          (setq-default fill-column 100)
          (setq visual-fill-column-center-text t)
          )
#+END_SRC
#+RESULTS:
: t

** COMMENT smartparens
#+BEGIN_SRC emacs-lisp

(after! smartparens
  :config
  (map! :map smartparens-mode-map
        "C-M-f" #'sp-forward-sexp
        "C-M-b" #'sp-backward-sexp
        "C-M-u" #'sp-backward-up-sexp
        "C-M-d" #'sp-down-sexp
        "C-M-p" #'sp-backward-down-sexp
        "C-M-n" #'sp-up-sexp
        "C-M-s" #'sp-splice-sexp
        "C-)" #'sp-forward-slurp-sexp
        "C-}" #'sp-forward-barf-sexp
        "C-(" #'sp-backward-slurp-sexp
        "C-M-)" #'sp-backward-slurp-sexp
        "C-M-)" #'sp-backward-barf-sexp))
#+END_SRC
** dubcaps mode
#+BEGIN_SRC emacs-lisp
(after! org
  (defun dcaps-to-scaps ()
    "Convert word in DOuble CApitals to Single Capitals."
    (interactive)
    (and (= ?w (char-syntax (char-before)))
         (save-excursion
           (let ((end (point)))
             (and (if (called-interactively-p)
                      (skip-syntax-backward "w")
                    (= -3 (skip-syntax-backward "w")))
                  (let (case-fold-search)
                    (looking-at "\\b[[:upper:]]\\{2\\}[[:lower:]]"))
                  (capitalize-region (point) end))))))
  (add-hook 'post-self-insert-hook #'dcaps-to-scaps nil 'local)

  (define-minor-mode dubcaps-mode
    "Toggle `dubcaps-mode'.  Converts words in DOuble CApitals to
Single Capitals as you type."
    :init-value nil
    :lighter (" DC")
    (if dubcaps-mode
        (add-hook 'post-self-insert-hook #'dcaps-to-scaps nil 'local)
      (remove-hook 'post-self-insert-hook #'dcaps-to-scaps 'local)))


  (add-hook 'text-mode-hook #'dubcaps-mode)
  (add-hook 'org-mode-hook #'dubcaps-mode))
#+END_SRC
** Modes
#+BEGIN_SRC emacs-lisp
(delete-selection-mode 1)                         ; Replace selection when inserting text
(display-time-mode 1)                             ; Enable time in the mode-line
(display-battery-mode 1)                          ; On laptops it's nice to know how much power you have
(global-subword-mode 1)                           ; Iterate through CamelCase words
(setq initial-major-mode 'org-mode)
(setq hungry-delete-mode t)
(show-smartparens-mode)
(global-hungry-delete-mode)
(nyan-mode)
#+END_SRC
** Modeline
#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+end_src




